planeWall2D_edit/system/wall/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

T
{
    internalField   uniform 300;

    boundaryField
    {
        inlet-wall
        {
            type            zeroGradient;
            value           uniform 300;
        }
		outlet-wall
        {
            type            zeroGradient;
            value           uniform 300;
        }
        "wall_to_.*"
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            kappaName       none;
            value           uniform 300;
        }
		
		frontandback-wall
        {
            type            empty;
        }
    }
}	
  
 p
 {
     internalField   uniform 1e5;

    boundaryField
    {
        inlet-wall
        {
            type            calculated;
            value           uniform 100000;
        }
		outlet-wall
        {
            type            calculated;
            value           uniform 100000;
        }
        "wall_to_.*"
        {
           type            calculated;
           value           uniform 100000;
        }

        frontandback-wall
        {
            type            empty;
        }
    }
 }


// ************************************************************************* //
